{
  "architectures": ["VJEPA2ViT"],
  "model_type": "vjepa2_1_vit_base_384",
  "hidden_size": 768,
  "intermediate_size": 3072,
  "num_hidden_layers": 12,
  "num_attention_heads": 12,
  "num_key_value_heads": 12,
  "head_dim": 64,
  "norm_eps": 1e-6,
  "img_size": 384,
  "patch_size": 16,
  "tubelet_size": 2,
  "num_frames": 32,
  "in_chans": 3,
  "pretrained_grid_size": 16,
  "interpolate_rope": true
}
